# coding=utf-8
__author__ = 'gu'


def bar_data():  # 第二个页面开心柱状图数据
    bar_list = ['1', '2', '3', '4', '5', '6', '7', '8']
    return bar_list


def line_data():  # 第二个页面开心折线图数据
    line_list1 = [25, 19, 15, 13, 12, 9, 7, 2, 5, 14, 8, 5]
    line_list2 = [5, 9, 5, 3, 2, 49, 7, 2, 5, 14, 8, 5]
    line_list3 = [25, 19, 5, 13, 12, 9, 7, 2, 5, 14, 8, 5]
    line_list4 = [2, 19, 15, 13, 12, 9, 37, 2, 5, 14, 8, 5]
    line_list5 = [25, 19, 1, 13, 1, 9, 7, 22, 5, 14, 8, 5]
    line_list6 = [25, 19, 15, 13, 2, 9, 7, 22, 5, 14, 8, 5]
    line_list7 = [5, 1, 1, 13, 12, 9, 7, 2, 5, 4, 8, 5]
    line_list8 = [0.6, 2.2, 5.9, 9.7, 15.8, 17.7, 10.8, 9.8, 7.2, 1.9, -5.1, -8.1]
    big_list = [line_list1, line_list2, line_list3, line_list4,
                line_list5, line_list6, line_list7, line_list8]
    return big_list


def pie_data():  # 第二个页面开心扇形图数据
    pie_list = ['1', '2', '3', '4', '5', '6', '7', '8']
    return pie_list


def home_line():  # home页面折线图数据
    all_list = [
        [1, 1, 1, 1, 12, 9, 7, 9, 11, 25, 22, 13],
        [16, 22, 18, 12, 11, 8, 6, 8, 22, 11, 23, 26],
        [13, 18, 26, 22, 17, 11, 16, 22, 18, 12, 11, 8],
        [6, 11, 18, 24, 15, 12, 26, 22, 17, 11, 16, 22],
        [2, 4.0, 7.9, 13.8, 11, 18, 24, 15, 12, 26, 17.2, 14.8],
        [-1.4, 2.5, 5.8, 2, 4.0, 7.9, 13.8, 11, 9.2, 15.9, 22.7, 22],
        [-3.7, -0.8, 2.9, -1.4, 2.5, 5.8, 2, 4.0, 7.6, 14.8, 22.3, 11],
        [0.6, 2.2, -3.7, -0.8, 2.9, -1.4, 2.5, 5.8, 5.9, 9.7, 15.8, 17.7]
    ]
    return all_list

def home_pie1():  # home页面8个扇形图数据
    pie1_list = ['12', '22', '32', '42', '52', '62', '72', '82']
    return pie1_list
def home_pie2():
    pie1_list = ['12', '22', '32', '42', '52', '62', '72', '82']
    return pie1_list
def home_pie3():
    pie1_list = ['12', '22', '32', '42', '52', '62', '72', '82']
    return pie1_list
def home_pie4():
    pie1_list = ['12', '22', '32', '42', '52', '62', '72', '82']
    return pie1_list
def home_pie5():
    pie1_list = ['12', '22', '32', '42', '52', '62', '72', '82']
    return pie1_list
def home_pie6():
    pie1_list = ['12', '22', '32', '42', '52', '62', '72', '82']
    return pie1_list
def home_pie7():
    pie1_list = ['12', '22', '32', '42', '52', '62', '72', '82']
    return pie1_list
def home_pie8():
    pie1_list = ['12', '22', '32', '42', '52', '62', '72', '82']
    return pie1_list
